#Problem0:
# Дан список [1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20
# ,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44
# ,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,
# 69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89
# ,90,91,92,93,94,95,96,97,98,99,100]
# # Ваша задача:
# # - разделите список на 3, заключите третий список внутрь второго, 
# а второй внутрь первого [1...33,[34...66, [67..100]]]
number = [1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20
,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44
,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,
69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89
,90,91,92,93,94,95,96,97,98,99,100]
a = number[0:33]
b = number[34:66]
c = number[67:100]
print (a,b,c)
#Problem1:
# Напишите программу, которая удаляет последний элемент из массива: 
# lst = [9, 5, 7, 4, 2, 6, 8, 1]
lst = [9, 5, 7, 4, 2, 6, 8, 1]
lst.remove(1)
print(lst)

#Problem2:
# Напишите программу, которая считает количество похожих элементов,
# в этом случае наш элемент "5" из массива: lst = [9, 5, 7, 5, 2, 6, 5, 1, 9, 54]
lst1 = [9, 5, 7, 5, 2, 6, 5, 1, 9, 54]
print(lst1.count(5))
#Problem3:
# # Создать пустой лист. Добавить в него сначала ваше имя, год рождения, любимый язык
#  программирования.
lst2=[]
lst2.append("Nurbek")
lst2.append("1995")
lst2.append("python")
print(lst2)

#Problem4:
# Удалить из листа [1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25] 
# все чётные индексы до 10.#Problem0:
lst=[1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25]
#1
del lst[0]
del lst[1]
del lst[2]
del lst[3]
del lst[4]
del lst[5]
del lst[6]
del lst[7]
del lst[8]
del lst[9]
del lst[10]
del lst[11]
del lst[12]
print(lst)

#2
#lst_new=lst.copy()
#lst_new.remove()


#3
#lst_new.pop()
